app/controllers/authors_controller.rb

INSERT INTO "authors" ("author_name", "author_city", "author_number_book", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_name", "andreas"], ["author_city", "Pairs"], ["author_number_book", 45], ["created_at", "2019-07-03 15:14:51.373462"], ["updated_at", "2019-07-03 15:14:51.373462"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save