app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "published_date", "description", "author_name", "page_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)